podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_S32K144.svd.xml
            <register>
               <name>SYNC</name>
               <description>Synchronization</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>CNTMIN</name>
                     <description>Minimum Loading Point Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The minimum loading point is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The minimum loading point is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CNTMAX</name>
                     <description>Maximum Loading Point Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The maximum loading point is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The maximum loading point is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REINIT</name>
                     <description>FTM Counter Reinitialization by Synchronization</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM counter continues to count normally</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM counter is updated with its initial value when the selected trigger is detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNCHOM</name>
                     <description>Output Mask Synchronization</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>OUTMASK register is updated with the value of its buffer in all rising edges of the FTM input clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>OUTMASK register is updated with the value of its buffer only by the PWM synchronization</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG0</name>
                     <description>PWM Synchronization Hardware Trigger 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Trigger is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Trigger is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TRIG0" > <name>TRIG1</name> <description>PWM Synchronization Hardware Trigger 1</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TRIG0" > <name>TRIG2</name> <description>PWM Synchronization Hardware Trigger 2</description> <bitOffset>6</bitOffset> </field>
                  <field>
                     <name>SWSYNC</name>
                     <description>PWM Synchronization Software Trigger</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Software trigger is not selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Software trigger is selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTINIT</name>
               <description>Initial State For Channels Output</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>CH0OI</name>
                     <description>Channel 0 Output Initialization Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The initialization value is 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The initialization value is 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OI" > <name>CH1OI</name> <description>Channel 1 Output Initialization Value</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH2OI</name> <description>Channel 2 Output Initialization Value</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH3OI</name> <description>Channel 3 Output Initialization Value</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH4OI</name> <description>Channel 4 Output Initialization Value</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH5OI</name> <description>Channel 5 Output Initialization Value</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH6OI</name> <description>Channel 6 Output Initialization Value</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0OI" > <name>CH7OI</name> <description>Channel 7 Output Initialization Value</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>OUTMASK</name>
               <description>Output Mask</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>CH0OM</name>
                     <description>Channel 0 Output Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel output is not masked. It continues to operate normally</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel output is masked. It is forced to its inactive state</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OM" > <name>CH1OM</name> <description>Channel 1 Output Mask</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH2OM</name> <description>Channel 2 Output Mask</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH3OM</name> <description>Channel 3 Output Mask</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH4OM</name> <description>Channel 4 Output Mask</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH5OM</name> <description>Channel 5 Output Mask</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH6OM</name> <description>Channel 6 Output Mask</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0OM" > <name>CH7OM</name> <description>Channel 7 Output Mask</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>COMBINE</name>
               <description>Function For Linked Channels</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>COMBINE0</name>
                     <description>Combine Channels For n = 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMP0</name>
                     <description>Complement Of Channel (n) For n = 0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel (n+1) output is the same as the channel (n) output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel (n+1) output is the complement of the channel (n) output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DECAPEN0</name>
                     <description>Dual Edge Capture Mode Enable For n = 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DECAP0</name>
                     <description>Dual Edge Capture Mode Captures For n = 0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The dual edge captures are inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The dual edge captures are active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTEN0</name>
                     <description>Deadtime Enable For n = 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The deadtime insertion in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The deadtime insertion in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYNCEN0</name>
                     <description>Synchronization Enable For n = 0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The PWM synchronization in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The PWM synchronization in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAULTEN0</name>
                     <description>Fault Control Enable For n = 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The fault control in this pair of channels is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The fault control in this pair of channels is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCOMBINE0</name>
                     <description>Modified Combine Mode For n = 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMBINE1</name>
                     <description>Combine Channels For n = 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="COMP0" > <name>COMP1</name> <description>Complement Of Channel (n) For n = 2</description> <bitOffset>9</bitOffset> </field>
                  <field>
                     <name>DECAPEN1</name>
                     <description>Dual Edge Capture Mode Enable For n = 2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="DECAP0" > <name>DECAP1</name> <description>Dual Edge Capture Mode Captures For n = 2</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN1</name> <description>Deadtime Enable For n = 2</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN1</name> <description>Synchronization Enable For n = 2</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN1</name> <description>Fault Control Enable For n = 2</description> <bitOffset>14</bitOffset> </field>
                  <field>
                     <name>MCOMBINE1</name>
                     <description>Modified Combine Mode For n = 2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMBINE2</name>
                     <description>Combine Channels For n = 4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="COMP0" > <name>COMP2</name> <description>Complement Of Channel (n) For n = 4</description> <bitOffset>17</bitOffset> </field>
                  <field>
                     <name>DECAPEN2</name>
                     <description>Dual Edge Capture Mode Enable For n = 4</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="DECAP0" > <name>DECAP2</name> <description>Dual Edge Capture Mode Captures For n = 4</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN2</name> <description>Deadtime Enable For n = 4</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN2</name> <description>Synchronization Enable For n = 4</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN2</name> <description>Fault Control Enable For n = 4</description> <bitOffset>22</bitOffset> </field>
                  <field>
                     <name>MCOMBINE2</name>
                     <description>Modified Combine Mode For n = 4</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMBINE3</name>
                     <description>Combine Channels For n = 6</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="COMP0" > <name>COMP3</name> <description>Complement Of Channel (n) for n = 6</description> <bitOffset>25</bitOffset> </field>
                  <field>
                     <name>DECAPEN3</name>
                     <description>Dual Edge Capture Mode Enable For n = 6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="DECAP0" > <name>DECAP3</name> <description>Dual Edge Capture Mode Captures For n = 6</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="DTEN0" > <name>DTEN3</name> <description>Deadtime Enable For n = 6</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="SYNCEN0" > <name>SYNCEN3</name> <description>Synchronization Enable For n = 6</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="FAULTEN0" > <name>FAULTEN3</name> <description>Fault Control Enable For n = 6</description> <bitOffset>30</bitOffset> </field>
                  <field>
                     <name>MCOMBINE3</name>
                     <description>Modified Combine Mode For n = 6</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEADTIME</name>
               <description>Deadtime Configuration</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the FTM input clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the FTM input clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the FTM input clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTVALEX</name>
                     <description>Extended Deadtime Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
