podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/FTM0_S32K144.svd.xml
            <register>
               <name>SWOCTRL</name>
               <description>FTM Software Output Control</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>CH0OC</name>
                     <description>Channel 0 Software Output Control Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The channel output is not affected by software output control</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The channel output is affected by software output control</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OC" > <name>CH1OC</name> <description>Channel 1 Software Output Control Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH2OC</name> <description>Channel 2 Software Output Control Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH3OC</name> <description>Channel 3 Software Output Control Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH4OC</name> <description>Channel 4 Software Output Control Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH5OC</name> <description>Channel 5 Software Output Control Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH6OC</name> <description>Channel 6 Software Output Control Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0OC" > <name>CH7OC</name> <description>Channel 7 Software Output Control Enable</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>CH0OCV</name>
                     <description>Channel 0 Software Output Control Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The software output control forces 0 to the channel output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The software output control forces 1 to the channel output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0OCV" > <name>CH1OCV</name> <description>Channel 1 Software Output Control Value</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH2OCV</name> <description>Channel 2 Software Output Control Value</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH3OCV</name> <description>Channel 3 Software Output Control Value</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH4OCV</name> <description>Channel 4 Software Output Control Value</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH5OCV</name> <description>Channel 5 Software Output Control Value</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH6OCV</name> <description>Channel 6 Software Output Control Value</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="CH0OCV" > <name>CH7OCV</name> <description>Channel 7 Software Output Control Value</description> <bitOffset>15</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PWMLOAD</name>
               <description>FTM PWM Load</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>CH0SEL</name>
                     <description>Channel 0 Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel match is not included as a reload opportunity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel match is included as a reload opportunity</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0SEL" > <name>CH1SEL</name> <description>Channel 1 Select</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH2SEL</name> <description>Channel 2 Select</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH3SEL</name> <description>Channel 3 Select</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH4SEL</name> <description>Channel 4 Select</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH5SEL</name> <description>Channel 5 Select</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH6SEL</name> <description>Channel 6 Select</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH7SEL</name> <description>Channel 7 Select</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>HCSEL</name>
                     <description>Half Cycle Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Half cycle reload is disabled and it is not considered as a reload opportunity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Half cycle reload is enabled and it is considered as a reload opportunity</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LDOK</name>
                     <description>Load Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Loading updated values is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Loading updated values is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLEN</name>
                     <description>Global Load Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Global Load Ok disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Global Load OK enabled. A pulse event on the module global load input sets the LDOK bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLDOK</name>
                     <description>Global Load OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LDOK bit is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCR</name>
               <description>Half Cycle Register</description>
               <addressOffset>0x9C</addressOffset>
               <fields>
                  <field>
                     <name>HCVAL</name>
                     <description>Half Cycle Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAIR0DEADTIME</name>
               <description>Pair 0 Deadtime Configuration</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the FTM input clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the FTM input clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the FTM input clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTVALEX</name>
                     <description>Extended Deadtime Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAIR1DEADTIME</name>
               <description>Pair 1 Deadtime Configuration</description>
               <addressOffset>0xA8</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the FTM input clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the FTM input clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the FTM input clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTVALEX</name>
                     <description>Extended Deadtime Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAIR2DEADTIME</name>
               <description>Pair 2 Deadtime Configuration</description>
               <addressOffset>0xB0</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the FTM input clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the FTM input clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the FTM input clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTVALEX</name>
                     <description>Extended Deadtime Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAIR3DEADTIME</name>
               <description>Pair 3 Deadtime Configuration</description>
               <addressOffset>0xB8</addressOffset>
               <fields>
                  <field>
                     <name>DTVAL</name>
                     <description>Deadtime Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DTPS</name>
                     <description>Deadtime Prescaler Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0x</name>
                           <description>Divide the FTM input clock by 1</description>
                           <value>0b0x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide the FTM input clock by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide the FTM input clock by 16</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTVALEX</name>
                     <description>Extended Deadtime Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
